{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2024-03-28",
        "metadataLastUpdated": "2024-03-28"
    },
    "description": "SAND2024-01040O\nPyRoCS software synthesizes mathematical equations from several domains—including information theory, ecology, and engineering sciences—to support resilience analysis for complex systems. Resilience is the ability of the complex system being analyzed to withstand, operate through, and recover from a disruption. The complex system can be a physical system such as an electric grid, an organization such as a company, or even a subfunction of an organization.  \n\nExisting mathematical equations for resilience analysis are found within multiple domains including information theory, biological sciences, and complex systems. This package synthesizes and refactors equations from these various domains to make them more generalizable for application across different types of complex systems relevant for resilience analysis. Users will be able to apply these equations to characterize different components of complex systems based on available data.  \nSandia National Laboratories is a multimission laboratory managed and operated by National Technology & Engineering Solutions of Sandia, LLC, a wholly owned subsidiary of Honeywell International Inc., for the U.S. Department of Energy’s National Nuclear Security Administration under contract DE-NA0003525.",
    "laborHours": 0.0,
    "languages": [
        "Python"
    ],
    "name": "A python package for analyzing Resilience of Complex Systems (pyRoCS) v.0.0",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/sandialabs/pyrocs",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "vcs": "git",
    "version": "0.0"
}