{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2024-10-23",
        "metadataLastUpdated": "2024-10-23"
    },
    "description": "SAND2024-08545O\nAlpheus is the code implementation of an advanced data structure addressing the technical challenge of analyzing a continuous data stream that is too big to fit in a computer's memory. Alpheus reports when explicitly-defined conditions on the data in the stream are met. Though the software doesn’t have a specific application domain, it was built to address challenges in cybersecurity. The software includes a representative cybersecurity data set, as well as simulated attack and benign activity.\n\nThe software’s capabilities are critical to real-world application. For example, it can operate with unlimited-sized data streams while maintaining the same theoretical performance and reporting guarantees. The code’s authors also improved execution performance by leveraging persistent memory. \n\nThe code is designed for use by the technical reviewers for the Algorithm Engineering and Experiments conference run by the Society for Industrial and Applied Mathematics.\nSandia National Laboratories is a multimission laboratory managed and operated by National Technology & Engineering Solutions of Sandia, LLC, a wholly owned subsidiary of Honeywell International Inc., for the U.S. Department of Energy’s National Nuclear Security Administration under contract DE-NA0003525.",
    "homepageURL": "https://ip.sandia.gov",
    "laborHours": 0.0,
    "languages": [
        "C",
        "C++",
        "python",
        "Bash"
    ],
    "name": "Alpheus",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/gpl-3.0",
                "name": "GPL-3.0"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://ip.sandia.gov",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "version": "1.0"
}