{
    "contact": {
        "email": "gilmorem@osti.gov"
    },
    "date": {
        "created": "2018-06-19",
        "metadataLastUpdated": "2022-11-10"
    },
    "description": "REOPT has been developed by Pacific Northwest Laboratory to provide information about remedial action technologies, including application and regulatory information for over 700 contaminants. REOPT is a user-friendly personal computer program and database that functions like an electronic encyclopedia, sorting and presenting information to quickly familiarize engineers and planners with available remediation technologies. The system will help users focus quickly on the remediation technologies most likely to be effective for a particular site and problem, and presents concise, easy-to-use information about those technologies, helping users identify the key factors and constraints to consider in evaluating the use of each technology. REOPT contains information on approximately 90 established (i.e., proven) remediation technologies that could potentially be used for DOE waste-site cleanup. REOPT also contains auxiliary information about hazardous and radioactive contaminants and the federal regulations that govern their disposal. REOPT contains data for approximately 90 remedial action technologies, divided into categories according to the portion of a remedial action (i.e., containment, treatment, disposal, etc.) that they relate to or perform. Technologies are also classified according to the contaminants to which they may be applied. Contaminants may be selected from a list of approximately 700 in ten organic and four inorganic categories. The information for each technology is organized into the broad categories of descriptive information, application information, and additional information sources; these are then subdivided to allow the user to access more specific information about the technology.",
    "homepageURL": "https://www.pnnl.gov/available-technologies",
    "laborHours": 0.0,
    "languages": [],
    "name": "An Electronic Encyclopedia of Remedial Options",
    "organization": "Office of Scientific and Technical Information (OSTI)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://www.pnnl.gov/available-technologies",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://www.pnnl.gov/available-technologies",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Office of Scientific and Technical Information (OSTI)"
    ]
}