{
    "contact": {
        "email": "pmaffetto@bnl.gov"
    },
    "date": {
        "created": "2021-03-16",
        "metadataLastUpdated": "2021-03-16"
    },
    "description": "The application of the XCA package as first demonstrated in aXiv:2008.00283. \n\nABSTRACT: The discovery of new structural and functional materials is driven by phase identification, often using X-ray diffraction (XRD). Automation has accelerated the rate of XRD measurements, greatly outpacing XRD analysis techniques that remain manual, time consuming, error prone, and impossible to scale. With the advent of autonomous robotic scientists or self-driving labs, contemporary techniques prohibit the integration of XRD. Here, we describe a computer program for the autonomous characterization of XRD data, driven by artificial intelligence (AI), for the discovery of new materials. Starting from structural databases, we train an ensemble model using a physically accurate synthetic dataset, which output probabilistic classifications --- rather than absolutes --- to overcome the overconfidence in traditional neural networks. This AI agent behaves as a companion to the researcher, improving accuracy and offering unprecedented time savings, and is demonstrated on a diverse set of organic and inorganic materials challenges. This innovation is directly applicable to inverse design approaches, robotic discovery systems, and can be immediately considered for other forms of characterization such as spectroscopy and the pair distribution function.",
    "laborHours": 0.0,
    "languages": [
        "Python"
    ],
    "name": "bnl/pub-Maffettone_2020_08",
    "organization": "Brookhaven National Laboratory (BNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/bnl/pub-Maffettone_2020_08",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Brookhaven National Laboratory (BNL)"
    ],
    "vcs": "git"
}