{
    "contact": {
        "email": "suzanne.hoffman@nrel.gov"
    },
    "date": {
        "created": "2019-10-25",
        "metadataLastUpdated": "2023-06-16"
    },
    "description": "CatCost™ is a state-of-the-art cost estimation tool designed to reduce the cost uncertainty associated with pre-commercial catalyst materials. The tool combines industry-standard cost estimation methods and resources into an intuitive suite of tools to bring actionable cost insight to every step of catalyst research and development. CatCost™ allows the rapid development of comprehensive catalyst cost estimates. It incorporates detailed insight into manufacturing methods, especially for pre-commercial catalysts, without requiring any process design experience.\n\nThe tool has been designed from the ground up with a number of user-selectable estimation methods, pricing libraries, and ease-of-use features to tailor an estimate to a user's skill level and need for customization, empowering researchers of all skill-levels to make better R&D decisions throughout the catalyst development cycle. Our costing methods are fully transparent and enable power-users the ability to adjust any estimate to the economic realities of their operation.\n\nThe tool has been designed from the ground up with a number of user-selectable estimation methods, pricing libraries, and ease-of-use features to tailor an estimate to a user's skill level and need for customization, empowering researchers of all skill-levels to make better R&D decisions throughout the catalyst development cycle. Our costing methods are fully transparent and enable power-users the ability to adjust any estimate to the economic realities of their operation.\n\nFeatures include:\nRaw materials pricing: Libraries of common chemicals, cost scaling indices, guidance for obtaining bulk quotes, and methods for extrapolating laboratory-scale prices to bulk.\nSimplified step method for synthesis by a contract manufacturer: All-in hourly cost for process equipment using methods and data from tollers. (Excel-only in v1.0)",
    "homepageURL": "https://catcost.chemcatbio.org",
    "laborHours": 0.0,
    "languages": [],
    "name": "CatCost™ (Catalyst Cost Estimation Tool) [SWR-18-74]",
    "organization": "National Renewable Energy Laboratory (NREL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://catcost.chemcatbio.org/disclaimer",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://catcost.chemcatbio.org",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "National Renewable Energy Laboratory (NREL)"
    ]
}