{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2021-08-06",
        "metadataLastUpdated": "2021-09-21"
    },
    "description": "The Exploration Toolkit (ExTK) is a reusable Extended Reality (XR) system developed for incorporating and exploring 3-Dimensional (3-D) computer aided design (CAD) models in XR, with a primary focus on Augmented Reality (AR). The ExTK consists of a Developer Mode and a User Mode. In Developer Mode, ExTK provides developers with the ability to easily import 3-D CAD models and activate desired exploration functionality and layout. Multiple models can be added to a single instantiation of the ExTK using Unity's Scene capability. Exploration functions include scaling, rotating, explode/contract, animations, hiding parts, submodules, and measurement functions. In User Mode, ExTK provides a menu system that allows users to select models and initiate exploration functions. ExTK is architected for reusability and developers can customize the ExTK layout and functions according to application needs. ExTK is designed to be hardware agnostic, although initial development focused on the Microsoft HoloLens as the primary deployment platform. The ExTK is developed using the Unity Game Engine Development Platform. Sandia National Laboratories is a multimission laboratory managed and operated by National Technology & Engineering Solutions of Sandia, LLC, a wholly owned subsidiary of Honeywell International Inc., for the U.S. Department of Energy’s National Nuclear Security Administration under contract DE-NA0003525. SAND2021-1506 O",
    "laborHours": 0.0,
    "languages": [
        "C#"
    ],
    "name": "Exploration ToolKit (ExTK)",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/mit",
                "name": "MIT"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/sandialabs/ExTK",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "vcs": "git",
    "version": "1.0"
}