{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2021-05-21",
        "metadataLastUpdated": "2021-06-08"
    },
    "description": "The \"Fuel Cycle Services Needs Estimator\", Version 2.0 allows users to estimate the amount of uranium enrichment services needed and amount of spent nuclear fuel produced by a given fleet of nuclear power reactors through 2050 based on user-determined information about the size of a reactor fleet and average characteristics of reactors in that fleet. The program helps users evaluate the current and future supply of nuclear fuel cycle services. The program also allows users to compare the enrichment needs and spent fuel production of more up to seven defined nuclear power reactor fleets and to aggregate estimated needs. Version 2.0 of the program has an additions of new graphs to show results of calculations (calculation capabilities and other graphing tools included in version 1.o), maps showing flows of material based on calculation results, and additional calculation capabilities that allow the user to compare supply to demand (demand calculations included in version 1.0). Default values for seven selected nuclear energy programs in East Asia are included for reference and comparison. The program was designed using the dynamic simulation software, Powersim.",
    "homepageURL": "https://ip.sandia.gov/contact-form",
    "laborHours": 0.0,
    "languages": [],
    "name": "Fuel Cycle Services Needs Estimator v.2.0",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://ip.sandia.gov/contact-form",
                "name": "Other"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://ip.sandia.gov/contact-form",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ]
}