{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2021-04-16",
        "metadataLastUpdated": "2024-07-24"
    },
    "description": "The GAM/GAMV GUI provides a graphic user interface to public domain FORTRAN codes (gam, version 2.0 and gamv, version 2.0) that were developed at Stanford University in 1998 (see Deutsch and Journel, 1998). The gam and gamv codes allow for calculation of different measures of spatial variability and spatial correction from a set of available data. The GAM/GAMV GUI accesses the executable versions of the gam and gamv software, initiates the calculations by the executables and manages the outputs of the executables in a user friendly graphical manner. Additionally, the GAM/GAMV GUI code then provides the user with both automatic and interactive tools in a graphical interface to fit models to the calculations of the spatial variation/correlation of the data. The GAM/GAMV GUI software allows the user to get various parameters for the gam and gamv executables that do the actual calculations by using dialog boxes, it provides some error checking as these parameters are set and then allows the user to run the calculation by calling the executable compiled from the previously developed FORTRAN software. The resulting output of the gam or gamv codes can be visualized in the GAM/GAMV GUI interface. The visualization portion of GAM/GAMV allows for both automatic and manual fitting of the model of spatial variation/correlation. GAM/GAMV GUI can be run in batch mode from the command line without invoking the graphical interface.",
    "laborHours": 0.0,
    "languages": [
        "Fortran"
    ],
    "name": "GAM/GAMV GUI",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://github.com/sandialabs/GAM-GAMV-GUI-AND-K3TD?tab=readme-ov-file#readme",
                "name": "Other"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/sandialabs/GAM-GAMV-GUI-AND-K3TD",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "vcs": "git",
    "version": "1.0"
}