{
    "contact": {
        "email": "suzanne.hoffman@nrel.gov"
    },
    "date": {
        "created": "2024-02-15",
        "metadataLastUpdated": "2024-02-21"
    },
    "description": "The National Renewable Energy Laboratory (NREL) and the U.S. Department of Energy's (DOE) Weatherization Assistance Program (WAP) are collaborating with the home energy retrofit industry to support the development of skilled workers. The Installer Badges Toolkit provides a flexible, customizable, and voluntary approach to training and skills recognition for WAP implementers, utility programs, private-sector workers, and contractors.\n\nIn Fiscal Year 2018, DOE, along with the Crew Leader scheme committee, determined the Retrofit Installer Technician (RIT) Job Task Analysis (JTA) could be eliminated and its tasks inserted in the Crew Leader JTA. The RIT tasks became the basis of the Installer Badges.\n\nThe Badges Toolkit was updated in 2020 to add licensing and copyright agreements. Users must cite the copyright information when using or distributing copies of the Badges Toolkit in any way. The technical content has remained unchanged from previous versions of the Badges Toolkit.\n\nThe Toolkit for home retrofits consists of 25 Badges, each representing different energy efficiency tasks that an installer could perform on a home. Each Badge defines the desired outcome, criteria to verify, applicable material requirements, and references to Standard Work Specifications (SWS) or other relevant standards.\n\nThe Badges provide a consistent approach to training by ensuring that installers in different regions are learning the same skills nationwide. Organizations can also customize the Toolkit by choosing only those Badges that are relevant to their program.\n\nThe Badges Toolkit includes five pieces:\n\n\"How to Use the Badges Toolkit\" provides a brief overview of how a Grantee, Subgrantee, or training provider may approach using the toolkit.\nThe \"Badges Toolkit: Worksheet\" includes what to consider when determining whether and how to best incorporate the Badges into a weatherization assistance program.\nThe \"Crew Leader Job Task Analysis Spreadsheet\" indicates how the Badges align with specific areas of the JTA.\nThe \"Installer Badges Passport\" features separate pages for each Badge, which include places for the installer and the supervisor/trainer to record the number of times a task has been successfully completed.\nThe \"Installer Badges Verification Criteria\" includes sample inspection checklists for each Badge. These can be modified as needed based on approved variance requests or more stringent requirements. They also provide a basis for consistent inspections and awarding of Badges.\n \n\nNote: All elements of the Badges Toolkit are designed for use by potential program implementers. They are not off-the-shelf products intended for immediate deployment. Program implementers must review and modify as needed, revise verification criteria to match local requirements, complete worksheets, and otherwise define the parameters of their own badging program.",
    "homepageURL": "https://sws.nrel.gov/installerbadges",
    "laborHours": 0.0,
    "languages": [],
    "name": "GHEP WIBT (Guidelines for Home Energy Professionals Weatherization Installer Badges Toolkit) [SWR-20-69]",
    "organization": "National Renewable Energy Laboratory (NREL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://creativecommons.org/licenses/by-nc/4.0/deed.en",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://sws.nrel.gov/installerbadges",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "National Renewable Energy Laboratory (NREL)"
    ]
}