{
    "contact": {
        "email": "zlu@anl.gov"
    },
    "date": {
        "created": "2024-11-05",
        "metadataLastUpdated": "2024-11-05"
    },
    "description": "Based on the well-established GREET model mainly for the United States (U.S.), Argonne National Laboratory (ANL), with the support of the U.S. Department of Energy (DOE), has collaborated with the International Energy Agency (IEA) to develop a global version of the R&D GREET model, referred to as GREET+. GREET+ is a consistent and comparable life cycle analysis (LCA) modeling platform to evaluate life-cycle energy use and greenhouse gas (GHG) emissions of vehicle/fuel systems and technologies. It examines the energy and GHG impacts of technological advancements in different world regions through 2050.\n\nThe GREET+ model builds upon the Excel platform of the R&D GREET® 2022 rev1 model and ANL’s previous efforts on two regionalized GREET versions, i.e., China-GREET for China and MENA-GREET for Middle East and North Africa (MENA). GREET+ covers 16 regions and countries, including Canada, the USA, Mexico, Brazil, Central and South America region A, Central and South America region B, the European Union, China, India, Japan, South Korea, Southeast Asia and Oceania, MENA, Central and South Africa, the UK, and Norway. The current version of GREET+ focuses on the background data of the fuel cycle (or well-to-wheels, WTW), enabling the generation of region-specific WTW results for fuels and vehicles technologies of interest.",
    "homepageURL": "https://greet.anl.gov/greet_plus",
    "laborHours": 0.0,
    "languages": [
        "Microsoft Excel"
    ],
    "name": "GREET+ Model 2024",
    "organization": "Argonne National Laboratory (ANL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://greet.anl.gov/copyright",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://greet.anl.gov/greet_plus",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Argonne National Laboratory (ANL)"
    ],
    "version": "2024"
}