{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2020-10-01",
        "metadataLastUpdated": "2024-07-19"
    },
    "description": "LabVIEW Task Manager is a debugging tool for use during code development in the National Instruments (NI) LabVIEW® IDE. While providing a dynamic & big-picture view of running code, an expandable/collapsible tree diagram displays detailed information (both static and dynamic) on all VIs in memory, belonging to a selected project/target. It allows for interacting with single or multiple selected VIs at a time, providing significant benefits while troubleshooting, and has the following features: Look & Feel similar to Windows® Task Manager; Selection of project/target; Lists all VIs in memory, grouped by class/library; Searches for and enumerates clones in memory; DropIn VI for including dynamically referenced clones (Clone Beacon);  'Refresh Now' (F5) re-reads all VIs in memory and adds new ones to the tree; Displays VI name, owning class/library, state, path, data size & code size; Displays VI FP Behavior, Reentrant?, Reentrancy Type, Paused? & Highlight?; Sort by any column, including by library name; Filter by item types vi, ctl, and vit/ctt;  Filter out vi.lib and global VIs; Tracking of, and ability to toggle, execution highlighting on multiple selected VIs; Tracking of paused VIs with ability to Pause/Resume/TogglePause multiple selected VIs; DropIn VI for pausing on a condition; If a clone initiates a pause, a different pause symbol is used for all clones of that same reentrant original VI; Select multiple VIs and open or close their FPs or BDs; Double Click a VI from the tree to bring the BD (first choice) or FP to front, if already open; and Select multiple top-level VIs and Abort them.",
    "laborHours": 1596.0,
    "languages": [
        "National Instruments (NI) LabVIEW®, versions 2010 through 2016",
        "LABVIEW",
        "HTML"
    ],
    "name": "LabVIEW Task Manager v. 1.10.0",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://bitbucket.org/lavag/labview-task-manager/src/master/Documentation/License.txt",
                "name": "Other"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/sandialabs/LVTM",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "vcs": "git",
    "version": "1.10"
}