{
    "contact": {
        "email": "garrettmw@ornl.gov"
    },
    "date": {
        "created": "2020-10-01",
        "metadataLastUpdated": "2020-10-01"
    },
    "description": "MathWorks' MATLAB is widely used in academia and industry for prototyping, data analysis, data processing, etc. Many users compile their programs using the MATLAB Compiler to run on workstations/computing clusters via the free MATLAB Compiler Runtime (MCR). The MCR facilitates the execution of code calling Application Programming Interfaces (API) functions from both base MATLAB and MATLAB toolboxes. In a Linux environment, a sizable number of third-party runtime dependencies (i.e. shared libraries) are necessary. Unfortunately, to the MTLAB community's knowledge, these dependencies are not documented, leaving system administrators and/or end-users to find/install the necessary libraries either as runtime errors resulting from them missing or by inspecting the header information of Executable and Linkable Format (ELF) libraries of the MCR to determine which ones are missing from the system. To address various shortcomings, Docker Images based on Community Enterprise Operating System (CentOS) 7, a derivative of Redhat Enterprise Linux (RHEL) 7, containing recent (2015-2017) MCR releases and their dependencies were created. These images, along with a provided sample Docker Compose YAML Script, can be used to create a simulated computing cluster where MATLAB Compiler created binaries can be executed using a sample Slurm Workload Manager script.",
    "laborHours": 45.6,
    "languages": [
        "Bash 4.x, Docker 17.09"
    ],
    "name": "MCR Container Tools",
    "organization": "Oak Ridge National Laboratory (ORNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/mit",
                "name": "MIT"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/ORNL/mcr-container-tools",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Oak Ridge National Laboratory (ORNL)"
    ],
    "vcs": "git"
}