{
    "contact": {
        "email": "suzanne.hoffman@nrel.gov"
    },
    "date": {
        "created": "2018-11-29",
        "metadataLastUpdated": "2024-03-11"
    },
    "description": "Data structures in Julia to enable power systems analysis. Also, PowerSimulations.jl is a Julia package for power system modeling and simulation found at https://github.com/NREL/PowerSimulations.jl. The objectives of the package are: Provide a flexible modeling framework that can accommodate problems of different complexity and at different time-scales. Streamline the construction of large scale optimization problems to avoid repetition of work when adding/modifying model details. Exploit Julia's capabilities to improve computational performance of large scale power system simulations. The flexible modeling framework is enabled through a modular set of capabilities that enable scalable power system analysis and exploration of new analysis methods. The modularity of PowerSimulations results from the structure of the simulations enabled by the package: Simulations define a set of problems that can be solved using numerical techniques. Problems are generated by expressing model formulations against system data For example, an annual production cost modeling simulation can be created by formulating a unit commitment model against system data to assemble a set of 365 daily time-coupled scheduling problems.",
    "laborHours": 8466.4,
    "languages": [
        "Julia"
    ],
    "name": "PowerSystems.jl and PowerSimulations.jl [SWR-18-23]",
    "organization": "National Renewable Energy Laboratory (NREL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/NREL/PowerSystems.jl",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "National Renewable Energy Laboratory (NREL)"
    ],
    "vcs": "git",
    "version": "v1.15.0"
}