{
    "contact": {
        "email": "chan@lanl.gov"
    },
    "date": {
        "created": "2021-06-04",
        "metadataLastUpdated": "2022-01-11"
    },
    "description": "Python-based Sampling Toolkit (PySTK) is a set of python functions developed for efficient data reduction via sampling for large-scale time-varying complex scientific datasets. PySTK provides a range of capabilities: starting from naive random sampling of data to a more sophisticated data-drives feature-preserving sampling for regular grid datasets. PySTK further includes the option of visualization the samples using open-source library Visualization ToolKit (VTK), reconstruction from the samples, and fast sample-based query mechanism for scientific datasets. PySTK is designed to be efficient yet extendable, as it strives to handle large datasets using primarily the Numpy-based operations. This toolkit uses the python-based multi-threading for effective use of available resources. Not only the big supercomputers, modern day laptops and desktops are used for data analysis purposes by the domain experts and data analysts. PySTK seamlessly enables the use of such hardware to handle big data sets. PySTK can be used to explore large datasets generated by HPC simulations with intelligent sampling algorithms and exploit the existing hardware for efficient data analysis. Aside from the sampling code, PySTK will further contain the related documentation, test/demo cases, details of its build system, unit test harness, and a scholarly bibliography.",
    "homepageURL": "https://www.lanl.gov/projects/feynman-center/deploying-innovation/intellectual-property/software-tools/open-source-software.php",
    "laborHours": 0.0,
    "languages": [],
    "name": "PySTK: Python-Based Sampling Toolkit",
    "organization": "Los Alamos National Laboratory (LANL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://www.lanl.gov/projects/feynman-center/deploying-innovation/intellectual-property/software-tools/open-source-software.php",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Los Alamos National Laboratory (LANL)"
    ]
}