{
    "contact": {
        "email": "copyrightadmin@sandia.gov"
    },
    "date": {
        "created": "2019-12-19",
        "metadataLastUpdated": "2020-11-04"
    },
    "description": "PyApprox provides flexible and efficient tools for high-dimensional approximation and uncertainty quantification. PyApprox implements methods addressing various issues surrounding high-dimensional parameter spaces and limited evaluations of expensive simulation models with the goal of facilitating simulation-aided knowledge discovery, prediction and design. Tools are provided for: (i) building surrogates using polynomial chaos expansions using least squares, compressive sensing and interpolation; (ii) sparse grid interpolation and quadrature; (iii) low-rank tensor-decompositions; (iv) multi-fidelity approximation and sampling; (v) large-scale Bayesian inference; (vi) numerical solvers for canonical ordinary and partial differential equations useful for demonstration purposes; compressive sensing solvers (vii) and (viii) visualization. The code is intended to as a python toolbox but provides c++ code with Python interfaces to computationally expensive algorithms to increase performance. SANDS2019-5458 M\n\nSandia National Laboratories is a multimission laboratory managed and operated by National Technology & Engineering Solutions of Sandia, LLC, a wholly owned subsidiary of Honeywell International Inc., for the U.S. Department of Energy’s National Nuclear Security Administration under contract DE-NA0003525. \n",
    "laborHours": 48807.2,
    "languages": [
        "C++",
        "Python"
    ],
    "name": "Python Approximation Toolbox (PyApprox) v. 1.0",
    "organization": "Sandia National Laboratories (SNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://github.com/sandialabs/pyapprox/blob/master/LICENSE",
                "name": "Other"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/sandialabs/pyapprox",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Sandia National Laboratories (SNL)"
    ],
    "vcs": "git",
    "version": "1.0"
}