{
    "contact": {
        "email": "gilmorem@osti.gov"
    },
    "date": {
        "created": "2018-06-28",
        "metadataLastUpdated": "2023-01-17"
    },
    "description": "RAAS1.1 is a software-based system designed to assist remediation professionals at each stage of the environmental analysis process. RAAS1.1 provides a template for environmental restoration analysis, and provides the user with key results at each step in the analysis. RAAS1.1 assists the user to develop a coherent and consistent site description, estimate baseline and residual risk to public health from the contaminated site, identify applicable environmental restoration technologies, and formulate feasible remedial response alternatives. In addition, the RAAS1.1 methodology allows the user to then assess and compare those remedial response alternatives across EPA criteria, including: compliance with objectives; short-term and long-term effectiveness; extent of treatment; and implementability of the technologies. The analytic methodology is segmented and presented in a standardized, concise, easy-to-use format that can be viewed on the personal computer screen, saved and further manipulated, or printed for later use. Each screen and analytic step is accessed via a user-friendly personal computer graphical interface. Intuitively-designed buttons, menus, and lists help the user focus in on the particular information and analysis component of interest; the corresponding results are presented in a format that facilitates their use in decision-making.",
    "homepageURL": "https://www.pnnl.gov/available-technologies",
    "laborHours": 0.0,
    "languages": [],
    "name": "Remedial Action Assessment System",
    "organization": "Office of Scientific and Technical Information (OSTI)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://www.pnnl.gov/available-technologies",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://www.pnnl.gov/available-technologies",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Office of Scientific and Technical Information (OSTI)"
    ]
}