{
    "contact": {
        "email": "suzanne.hoffman@nrel.gov"
    },
    "date": {
        "created": "2023-07-25",
        "metadataLastUpdated": "2023-07-25"
    },
    "description": "See the SAM™ website to build a desktop version of the National Renewable Energy Laboratory's (NREL's) System Advisor Model™ (SAM). https://sam.nrel.gov/\n\nThe System Advisor Model™ (SAM™) is a free techno-economic software model that facilitates decision-making for people in the renewable energy industry:\n\n-Project managers and engineers\n-Policy analysts\n-Technology developers\n-Researchers\nSAM can model many types of renewable energy systems:\n\n-Photovoltaic systems, from small residential rooftop to large utility-scale systems\n-Battery storage with Lithium ion, lead acid, or flow batteries for front-of-meter or behind-the-meter applications\n-Concentrating Solar Power systems for electric power generation, including parabolic trough, power tower, and linear Fresnel\n-Industrial process heat from parabolic trough and linear Fresnel systems\n-Wind power, from individual turbines to large wind farms\n-Marine energy wave and tidal systems\n-Solar water heating\n-Fuel cells\n-Geothermal power generation\n-Biomass combustion for power generation\n-High concentration photovoltaic systems\n\nSAM's financial models are for the following types of projects:\n\n-Residential and commercial projects where the renewable energy system is on the customer side of the electric utility meter (behind the meter), and power from the system is used to reduce the customer's electricity bill.\n\n-Power purchase agreement (PPA) projects where the system is connected to the grid at an interconnection point, and the project earns revenue through power sales. The project may be owned and operated by a single owner or by a partnership involving a flip or leaseback arrangement.\n\n-Third party ownership where the system is installed on the customer's (host) property and owned by a separate entity (developer), and the host is compensated for power generated by the system through either a PPA or lease agreement.\n\nFor a more detailed description of SAM, see Blair et al. (2018), System Advisor Model (SAM) General Description (Version 2017.9.5), NREL/TP-6A20-70414. \n\nhttps://www.nrel.gov/docs/fy18osti/70414.pdf\n",
    "laborHours": 552915.2,
    "languages": [
        "C++",
        "LK script"
    ],
    "name": "SAM™ (System Advisor Model™) [SWR-16-02, SWR-10-13]",
    "organization": "National Renewable Energy Laboratory (NREL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            },
            {
                "URL": "https://api.github.com/licenses/lgpl-3.0",
                "name": "LGPL-3.0"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/NREL/SAM",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "National Renewable Energy Laboratory (NREL)"
    ],
    "vcs": "git",
    "version": "2020.2.29"
}