{
    "contact": {
        "email": "john.rinck@lbl.gov"
    },
    "date": {
        "created": "2024-06-27",
        "metadataLastUpdated": "2024-07-01"
    },
    "description": "This software was designed as a sequence validation tool for the assembly of synthetic constructs, where the constructs have a high degree of similarity and thus are barcoded prior to the sequencing library prep. It demultiplexes each FASTQ file for each barcode, then analyzes the resulting FASTQ files against a list of reference sequences for that barcode/library, combining the results from eight sequencing libraries to generate a summary, and the files needed to view the results in the Integrative Genomics Viewer (IGV) application for manual verification. This was developed for FASTQ files generated by PacBio sequencing, but could be used on any FASTQ files that do not have paired end reads. It can be used to analyze one - eight libraries at a time. Each construct is independently analyzed with only the sequences with the same barcode, in the same pooled library. Then the results are combined into a user friendly summary. This is used to identify which libraries of pooled sequences contains a perfect match, or fixable match to the reference file. This pipeline uses many freely available open source libraries, the value added is that in our application the steps of the pipeline are defined in Workflow Description Language (WDL) and run through the Cromwell workflow engine in Docker containers, for easy distribution and set up, as well as the user friendly html summary that is generated.",
    "laborHours": 3800.0,
    "languages": [],
    "name": "SynBio QC Dual Barcode QC (DBC) v1.0",
    "organization": "Lawrence Berkeley National Laboratory (LBNL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://code.jgi.doe.gov/jgi-synbio-public/synbioqc-dual_barcode",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Lawrence Berkeley National Laboratory (LBNL)"
    ]
}