{
    "contact": {
        "email": "david.long@pnnl.gov"
    },
    "date": {
        "created": "2022-07-18",
        "metadataLastUpdated": "2022-07-19"
    },
    "description": "SID characterizes natural language based documents so that they may be related and retrieved based on content similarity. This technology processes textual documents, autonomously identifies the major topics of the document set, and constructs an interpretable, high dimensional representation of each document. SID also provides the ability to interactively reweight representations based on user need, so users may analyze the dataset from multiple points of view. The particular advantages SID offers are speed, data compression, flexibility in representation, and incremental processing. SPIRE consists of software for visual analysis of text-based information sources. This technology enables users to make discoveries about the content of very large sets of textual documents without requiring the user to read or presort the documents. It employs algorithms for text and word proximity analysis to identify the key themes within the documents. The results of this analysis are projected onto a visual spatial proximity display (Galaxies or Themescape) where document proximity represents the degree of relatedness of theme.",
    "homepageURL": "https://www.pnnl.gov/available-technologies",
    "laborHours": 0.0,
    "languages": [],
    "name": "System for Information Discovery - SPIRE",
    "organization": "Pacific Northwest National Laboratory (PNNL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://www.pnnl.gov/available-technologies",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://www.pnnl.gov/available-technologies",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Pacific Northwest National Laboratory (PNNL)"
    ]
}