{
    "contact": {
        "email": "david.long@pnnl.gov"
    },
    "date": {
        "created": "2022-07-18",
        "metadataLastUpdated": "2022-07-19"
    },
    "description": "TRA was developed as a computer tool for the DOE Office of River Protection (ORP) that will provides the capability to visualize and rapidly understand information about the risks associated with the River protection Project (RPP). Previously, technical and programmatic risk management within ORP had relied heavily on risk lists and other techniques that presented risk information but did not place it in perspective of the overall project. This made it difficult for ORP senior management to understand the risk information presented, prioritize their activities, and provide direction to ORP staff and contractors about how to manage specific risk events. The TRA visualization tool, provides the appropriate context and perspective that allows senior management to effectively manage risks. Basically, the TRA overlays information about risks associated with specific activities and their magnitudes on top of the project baseline schedule. this provides senior management with information about the magnitudes of specific risk events as well as their timing, and allows them to focus their attention and resources on the risks that merit attention and possible further action. The TRA tool can also be used to display other types of information associated with scheduled activities, such as cost to date, technical performance, schedule performance, etc. Additionally, the base of the 3-dimensional representation can be changed to other types of graphics, such as maps, process flow diagrams, etc., which allows the display of other types of information, such as hazards, health and safety risks, and system availability.",
    "homepageURL": "https://www.pnnl.gov/available-technologies",
    "laborHours": 0.0,
    "languages": [],
    "name": "Topographical Risk Assessment",
    "organization": "Pacific Northwest National Laboratory (PNNL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://www.pnnl.gov/available-technologies",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://www.pnnl.gov/available-technologies",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Pacific Northwest National Laboratory (PNNL)"
    ]
}