{
    "contact": {
        "email": "chan@lanl.gov"
    },
    "date": {
        "created": "2022-03-11",
        "metadataLastUpdated": "2022-03-11"
    },
    "description": "Unified Reaction Structures for Astrophysics (URSA) defines a format for nuclear inputs used in the simulation of astrophysical nucleosynthesis. Data of this type is currently stored, transferred, and implemented using a disparate patchwork of data formats and supporting codes. URSA intends to unify these disparate data sources/formats into a single data structure that accommodates the fullest possible range of different reaction types arising in astrophysical environments (e.g., transfer, pickup, or capture reactions; radioactive decay; or delayed particle emission, among many other possibilities). Furthermore, URSA provides a modern and efficient C++ library that existing and/or future astrophysics simulation codes may link against to directly implement nuclear data libraries constructed within the URSA format. In this approach, URSA will ensure that nuclear data inferred from measurements and generated by new facilities such as the Facility for Rare Isotope Beams (FRIB) is appropriately and consistently used in astrophysical applications.",
    "homepageURL": "https://www.lanl.gov/projects/feynman-center/deploying-innovation/intellectual-property/software-tools/open-source-software.php",
    "laborHours": 0.0,
    "languages": [],
    "name": "Unified Reaction Structures for Astrophysics (URSA)",
    "organization": "Los Alamos National Laboratory (LANL)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://api.github.com/licenses/bsd-3-clause",
                "name": "BSD-3-Clause"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://www.lanl.gov/projects/feynman-center/deploying-innovation/intellectual-property/software-tools/open-source-software.php",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Los Alamos National Laboratory (LANL)"
    ]
}