{
    "contact": {
        "email": "david.long@pnnl.gov"
    },
    "date": {
        "created": "2024-01-17",
        "metadataLastUpdated": "2024-01-31"
    },
    "description": "VSP selects the appropriate number and location of environmental samples to ensure that the results of statistical tests performed to provide input to risk decisions have the required confidence and performance. VSP Version 5.0 provides sample-size equations or algorithms needed by specific statistical tests appropriate for specific environmental sampling objectives. It also provides data quality assessment and statistical analysis functions to support evaluation of the data and determine whether the data support decisions regarding sites suspected of contamination. The easy-to-use program is highly visual and graphic. VSP runs on personal computers with Microsoft Windows operating systems (98, NT, 2000, Millennium Edition, CE, and XP) Designed primarily for project managers and users without expertise in statistics, VSP is applicable to two- and three-dimensional populations to be sampled (e.g., rooms and buildings, surface soil, a defined layer of subsurface soil, water bodies, and other similar applications) for studies of environmental quality. VSP is also applicable for designing sampling plans for assessing chem./rad/bio threat and hazard identification within rooms and buildings, and for designing geophysical surveys for UXO identification.",
    "homepageURL": "https://www.pnnl.gov/projects/visual-sample-plan",
    "laborHours": 0.0,
    "languages": [],
    "name": "Visual Sample Plan",
    "organization": "Pacific Northwest National Laboratory (PNNL)",
    "permissions": {
        "exemptionText": "This source code is restricted by patent and / or intellectual property law.",
        "licenses": [
            {
                "URL": "https://www.pnnl.gov/projects/visual-sample-plan",
                "name": "Other"
            }
        ],
        "usageType": "exemptByLaw"
    },
    "repositoryURL": "https://www.pnnl.gov/projects/visual-sample-plan",
    "status": "Production",
    "tags": [
        "DOE CODE",
        "Pacific Northwest National Laboratory (PNNL)"
    ]
}