{
    "contact": {
        "email": "krhodges@illinois.edu"
    },
    "date": {
        "created": "2024-11-01",
        "metadataLastUpdated": "2024-11-01"
    },
    "description": "Multiplexed proteomics has emerged as a powerful tool to measure relative protein expression levels across multiple conditions. The relative protein abundances are inferred by comparing the signals generated by isobaric tags, which encode the samples’ origins. Intuitively, the trust associated with a protein measurement depends on the similarity of ratios from the protein’s peptides and the signal-strength of these measurements. However, typically the average peptide ratio is reported as the estimate of relative protein abundance, which is only the most likely ratio with a very naive model. Moreover, there is no sense on the confidence in these measurements. Here, we present a mathematically rigorous approach that integrates peptide signal strengths and peptide-measurement agreement into an estimation of the true protein ratio and the associated confidence (BACIQ).\n\nThe main advantages of BACIQ are:\n\nIt removes the need to threshold reported peptide signal based on an arbitrary cut-off, thereby reporting more measurements from a given experiment;\nConfidence can be assigned without replicates;\nFor repeated experiments BACIQ provides confidence intervals for the union, not the intersection, of quantified proteins; and\nFor repeated experiments, BACIQ confidence intervals are more predictive than confidence intervals based on protein measurement agreement.\nTo demonstrate the power of BACIQ, we reanalyzed previously published data on subcellular protein movement upon treatment with an Exportin-1 inhibiting drug. We detect ~2x more highly significant movers, down to subcellular localization changes of ~1% . Thus, our method drastically increases the value obtainable from quantitative proteomics experiments helping researchers to interpret their data and prioritize resources. To make our approach easily accessible we distribute it via a Python/Stan package.",
    "laborHours": 364.8,
    "languages": [],
    "name": "wuhrlab/BACIQ",
    "organization": "Contractor (CONTR)",
    "permissions": {
        "exemptionText": null,
        "licenses": [
            {
                "URL": "https://github.com/wuhrlab/BACIQ/?tab=GPL-3.0-1-ov-file#readme",
                "name": "Other"
            }
        ],
        "usageType": "openSource"
    },
    "repositoryURL": "https://github.com/wuhrlab/BACIQ",
    "status": "Development",
    "tags": [
        "DOE CODE",
        "Contractor (CONTR)"
    ],
    "vcs": "git"
}